#!/usr/bin/python3
# -*- coding: utf-8 -*-

# 默认以20210115的MA250为basePrice基准价、MA1000为basePrice2、MA30为sellPrice目标价，历史最高的某价格为sellPrice2，20210115的MA1000为initPrice
# codeData格式：{code: (basePrice, basePrice2, sellPrice, sellPrice2, initPrice, secuType, initMoney, powerN)}
codeData = {
    # 中证白酒。20210106的最高价为sellPrice2
    'sz399997': (11280.68, 7130.26, 17686.38, 20765.23, 7130.26, 'index', -1, -1),
    # 中证消费。20210108的最高价为sellPrice2
    'sh000932': (20966.94, 14213.29, 27110.96, 30754.18, 14213.29, 'index', -1, -1),
    # 深证红利。20210113的最高价为sellPrice2
    'sz399324': (10966.54, 8799.51, 13474.34, 14810.61, 8799.51, 'index', -1, -1),
    # 深证F60。20210113的最高价为sellPrice2
    'sz399701': (8881.3, 7293.87, 10461.59, 11378.46, 7293.87, 'index', -1, -1),
    # 沪深300。20071017的最高价为sellPrice2
    'sh000300': (4429.11, 3861.65, 5160.74, 5891.72, 3861.65, 'index', -1, -1),
    # 上证50。20071016的最高价为sellPrice2
    'sh000016': (3141.81, 2785.75, 3598.86, 4772.93, 2785.75, 'index', -1, -1),
    # 上证指数。20151223的最高价为sellPrice、20150625 MA30为sellPrice2
    'sh000001': (3146.21, 3066.35, 3684.57, 4771.84, 3066.35, 'index', -1, -1),
    # 恒生指数。20180208 MA30为sellPrice、20180129的最高价为sellPrice2
    'hkHSI': (25307.47, 26973.71, 31631.45, 33484.08, 26973.71, 'index', -1, -1)
}
